; domain
(define (domain spanner)
(:requirements :typing :strips)
(:types
	location locatable - object
	man nut spanner - locatable
)

(:predicates
	(at ?m - locatable ?l - location)
	(carrying ?m - man ?s - spanner)
	(useable ?s - spanner)
	(link ?l1 - location ?l2 - location)
	(tightened ?n - nut)
	(loose ?n - nut))

(:action walk 
:parameters (?param_1 - location ?param_2 - location ?param_3 - man) 
:precondition (and
		(at ?param_3 ?param_1) (link ?param_1 ?param_2)
)
:effect (and (at ?param_3 ?param_2) (not (at ?param_3 ?param_1))))

(:action pickup_spanner 
:parameters (?param_1 - location ?param_2 - spanner ?param_3 - man) 
:precondition (and
		(at ?param_2 ?param_1) (at ?param_3 ?param_1)
)
:effect (and (carrying ?param_3 ?param_2) (not (at ?param_2 ?param_1))))

(:action tighten_nut 
:parameters (?param_1 - location ?param_2 - spanner ?param_3 - man ?param_4 - nut) 
:precondition (and
		(at ?param_3 ?param_1) (at ?param_4 ?param_1) (useable ?param_2)
)
:effect (and (tightened ?param_4) (not (useable ?param_2)) (not (loose ?param_4))))
)

; problem
(define (problem prob)
 (:domain spanner)
 (:objects
     bob - man
     spanner1 spanner2 - spanner
     nut1 - nut
     location1 location2 - location
     shed gate - location
    )
 (:init
    (at bob shed)
    (at spanner1 location1)
    (at spanner2 location2)
    (useable spanner1)
    (useable spanner2)
    (loose nut1)
    (at nut1 gate)
    (link shed location1)
    (link location2 gate)
    (link location1 location2)
)
 (:goal
  (and
   (tightened nut1)
)))

; plan
1. (walk shed location1 bob)
   deleted: (at bob shed)
   added: (at bob location1)
   goals met: 0 of 1
2. (walk location1 location2 bob)
   deleted: (at bob location1)
   added: (at bob location2)
   goals met: 0 of 1
3. (pickup_spanner location2 spanner2 bob)
   deleted: (at spanner2 location2)
   added: (carrying bob spanner2)
   goals met: 0 of 1
4. (walk location2 gate bob)
   deleted: (at bob location2)
   added: (at bob gate)
   goals met: 0 of 1
5. (tighten_nut gate spanner1 bob nut1)
   deleted: (useable spanner1) (loose nut1)
   added: (tightened nut1)
   goals met: 1 of 1
